Управление_закупками/src/BusinessProcesses/ПередачаЗаказаВОМТС/ПередачаЗаказаВОМТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ПередачаЗаказаВОМТС</name>
  <task>Task.ЗадачиИсполнителейПТО</task>
  <attributes>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

Управление_закупками/src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <registerRecords>AccumulationRegister.ОстатокПотребностиПоВнутреннимЗаказам</registerRecords>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоставки</name>
    <type>
      <types>EnumRef.ВидПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяДокументация</name>
    <type>
      <types>CatalogRef.РабочаяДокументация</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСогласованПТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказОтправленВОМТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЗаказаВОМТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправилВОМТС</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗаказа</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДляКорректировки</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_закупками/src/BusinessProcesses/ПередачаЗаказаВОМТС/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ЗаказСогласованПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнутреннийЗаказ,"ЗаказСогласованПТО");
	
КонецПроцедуры

Процедура СогласоватьЗаказПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
		
	НоваяЗадача = Задачи.ЗадачиИсполнителейПТО.СоздатьЗадачу(); 
	НоваяЗадача.БизнесПроцесс = ЭтотОбъект.Ссылка;    
	НоваяЗадача.ТочкаМаршрута = ТочкаМаршрутаБизнесПроцесса; 	
	НоваяЗадача.Дата = ТекущаяДатаСеанса();  
	
	НомерИДатаВнутреннегоЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВнутреннийЗаказ,"Номер, Дата");
	НоваяЗадача.Наименование = СтрШаблон("Согласовать внутренний заказ № %1 от %2.", 
								НомерИДатаВнутреннегоЗаказа.Номер, Формат(НомерИДатаВнутреннегоЗаказа.Дата,"ДФ=dd.MM.yyyy")); 	 
	НоваяЗадача.Инициатор = КадрыСервер.ТекущийСотрудник();
	НоваяЗадача.Должность = Справочники.Должности.РуководительПТО;
	ФормируемыеЗадачи.Добавить(НоваяЗадача);
	
	СтандартнаяОбработка = Ложь;
	Записать(); 
	
КонецПроцедуры


Процедура ДоработатьЗаказПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	НоваяЗадача = Задачи.ЗадачиИсполнителейПТО.СоздатьЗадачу(); 
	НоваяЗадача.БизнесПроцесс = ЭтотОбъект.Ссылка;    
	НоваяЗадача.ТочкаМаршрута = ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата = ТекущаяДатаСеанса();
	НоваяЗадача.Наименование = СтрШаблон("Доработать и отправить на согласование внутренний заказ № %1 от %2.", 
										 ВнутреннийЗаказ.Номер, Формат(ВнутреннийЗаказ.Дата,"ДФ=dd.MM.yyyy")); 	 
	НоваяЗадача.Инициатор = КадрыСервер.ТекущийСотрудник();
	
	ПредыдущаяЗадача = БизнесПроцессыИЗадачиСервер.ПолучитьПоследююЗадачуПоТочкеМаршрута(ЭтотОбъект.Ссылка, БизнесПроцессы.ПередачаЗаказаВОМТС.ТочкиМаршрута.СогласоватьЗаказ);  
	ИсполнительИЗадание = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПредыдущаяЗадача,"ИсполнительБудущейЗадачи, Замечания");
	НоваяЗадача.Исполнитель = ИсполнительИЗадание.ИсполнительБудущейЗадачи;
	
	НоваяЗадача.Замечания = ИсполнительИЗадание.Замечания;
	ФормируемыеЗадачи.Добавить(НоваяЗадача);
	
	СтандартнаяОбработка = Ложь;
	Записать(); 
	 
КонецПроцедуры

Процедура ОтправитьНепосредственноВОМТСПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнутреннийЗаказ,"ЗаказОтправленВОМТС");
	
КонецПроцедуры

Процедура ОтправитьВОМТСПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)

	НоваяЗадача = Задачи.ЗадачиИсполнителейПТО.СоздатьЗадачу(); 
	НоваяЗадача.БизнесПроцесс = ЭтотОбъект.Ссылка;    
	НоваяЗадача.ТочкаМаршрута = ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата = ТекущаяДатаСеанса();
	НоваяЗадача.Наименование = СтрШаблон("Отправить в ОМТС внутренний заказ № %1 от %2.", 
										  ВнутреннийЗаказ.Номер, Формат(ВнутреннийЗаказ.Дата,"ДФ=dd.MM.yyyy"));
	НоваяЗадача.Инициатор = КадрыСервер.ТекущийСотрудник();
	НоваяЗадача.Должность = Справочники.Должности.РуководительПТО;
	ФормируемыеЗадачи.Добавить(НоваяЗадача);
	
	СтандартнаяОбработка = Ложь;
	Записать();
	
КонецПроцедуры

Процедура СоздатьЗадачуРаспределениеЗаявкиПоИсполителямОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Запрос = Новый  Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннийЗаказТовары.Номенклатура КАК Номенклатура,
	|	ВнутреннийЗаказТовары.ЕдиницаИзмеренияЗаказа КАК ЕдиницаИзмерения,
	|	СУММА(ВнутреннийЗаказТовары.Количество) КАК Количество,
	|	ВнутреннийЗаказТовары.ДополнительныеХарактеристикиНоменклатуры КАК ДополнительныеХарактеристикиНоменклатуры
	|ИЗ
	|	Документ.ВнутреннийЗаказ.Товары КАК ВнутреннийЗаказТовары
	|ГДЕ
	|	ВнутреннийЗаказТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВнутреннийЗаказТовары.Номенклатура,
	|	ВнутреннийЗаказТовары.ЕдиницаИзмеренияЗаказа,
	|	ВнутреннийЗаказТовары.ДополнительныеХарактеристикиНоменклатуры";
	
	 Запрос.УстановитьПараметр("Ссылка", ВнутреннийЗаказ); 
	 Результат = Запрос.Выполнить();
	 
	 Если Результат.Пустой() Тогда
		 Возврат;
	 КонецЕсли;
	 
	 СписокМатериалов = Результат.Выгрузить();
	
	 БизнесПроцессыИЗадачиСервер.СоздатьЗадачуРаспределениеЗаявкиПоИсполителям(ВнутреннийЗаказ, СписокМатериалов);
	
	
КонецПроцедуры

#КонецОбласти
